In [1]:
pip install pyspark

Collecting pyspark
  Downloading pyspark-4.0.0.tar.gz (434.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 434.1/434.1 MB 3.0 MB/s eta 0:00:0000:0100:05
  Preparing metadata (setup.py) ... done
Collecting py4j==0.10.9.9 (from pyspark)
  Downloading py4j-0.10.9.9-py2.py3-none-any.whl.metadata (1.3 kB)
Downloading py4j-0.10.9.9-py2.py3-none-any.whl (203 kB)
Building wheels for collected packages: pyspark
  DEPRECATION: Building 'pyspark' using the legacy setup.py bdist_wheel mechanism, which will be removed in a future version. pip 25.3 will enforce this behaviour change. A possible replacement is to use the standardized build interface by setting the `--use-pep517` option, (possibly combined with `--no-build-isolation`), or adding a `pyproject.toml` file to the source tree of 'pyspark'. Discussion can be found at https://github.com/pypa/pip/issues/6334
  Budone
  Created wheel for pyspark: filename=pyspark-4.0.0-py2.py3-none-any.whl size=434741298 sha256=8e1a1a9d5605e51cb49d8794e34ded5681bf345fc75a93c4c7712d75b6fd2d1d
  Stored in directory: /Users/whiplash/Library/Caches/pip/wheels/2d/77/9b/12660be70f7f447940a0caede37ae208b2e0d1c8487dce52a6
Successfully built pyspark
Installing collected packages: py4j, pyspark
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2/2 [pyspark]m1/2 [pyspark]
Successfully installed py4j-0.10.9.9 pyspark-4.0.0
Note: you may need to restart the kernel to use updated packages.

In [1]:
from pyspark.sql import SparkSession

In [2]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Practise").getOrCreate()

25/06/04 13:56:14 WARN Utils: Your hostname, Zohebs-MacBook-Pro.local resolves to a loopback address: 127.0.0.1; using 192.168.2.90 instead (on interface en0)
25/06/04 13:56:14 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.apache.spark.unsafe.Platform (file:/opt/homebrew/Caskroom/miniforge/base/envs/pyspark11/lib/python3.10/site-packages/pyspark/jars/spark-unsafe_2.12-3.2.1.jar) to constructor java.nio.DirectByteBuffer(long,int)
WARNING: Please consider reporting this to the maintainers of org.apache.spark.unsafe.Platform
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/06/04 13:56:15 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [3]:
spark

In [4]:
df = spark.read.csv("titanic.csv")

In [5]:
df

DataFrame[_c0: string, _c1: string, _c2: string, _c3: string, _c4: string, _c5: string, _c6: string, _c7: string, _c8: string, _c9: string, _c10: string]

In [6]:
df.show()

+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
|                 _c0|   _c1|         _c2|  _c3|     _c4|          _c5|     _c6|    _c7|  _c8|  _c9|    _c10|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
|                name|gender|         age|class|embarked|      country|ticketno|   fare|sibsp|parch|survived|
| Abbing, Mr. Anthony|  male|          42|  3rd|       S|United States|    5547|   7.11|    0|    0|      no|
|Abbott, Mr. Eugen...|  male|          13|  3rd|       S|United States|    2673|  20.05|    0|    2|      no|
|Abbott, Mr. Rossm...|  male|          16|  3rd|       S|United States|    2673|  20.05|    1|    1|      no|
|Abbott, Mrs. Rhod...|female|          39|  3rd|       S|      England|    2673|  20.05|    1|    1|     yes|
|Abelseth, Miss. K...|female|          16|  3rd|       S|       Norway|  348125|   7.13|    0|    0|     yes|
|Abelseth, Mr. Ola...|  male|          25|  3rd|       S|United States|  348122|   7.13|    0|    0|     yes|
| Abelson, Mr. Samuel|  male|          30|  2nd|       C|       France|    3381|     24|    1|    0|      no|
|Abelson, Mrs. Hannah|female|          28|  2nd|       C|       France|    3381|     24|    1|    0|     yes|
|Abī-Al-Munà, Mr. ...|  male|          27|  3rd|       C|      Lebanon|    2699|18.1509|    0|    0|     yes|
|Abrahamsson, Mr. ...|  male|          20|  3rd|       S|      Finland| 3101284| 7.1806|    0|    0|     yes|
|  Ådahl, Mr. Mauritz|  male|          30|  3rd|       S|       Sweden|    7076|   7.05|    0|    0|      no|
|     Adams, Mr. John|  male|          27|  3rd|       S|      England|  341826|   8.01|    0|    0|      no|
|Ahlin, Mrs. Johan...|female|          40|  3rd|       S|       Sweden|    7546| 9.0906|    1|    0|      no|
|Aks, Master. Fran...|  male|0.8333333333|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|      Aks, Mrs. Leah|female|          18|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|Aldworth, Mr. Aug...|  male|          35|  2nd|       S|      England|  248744|     13|    0|    0|      no|
|Alexander, Mr. Wi...|  male|          25|  3rd|       S|      England|    3474| 7.1709|    0|    0|      no|
|Alhomäki, Mr. Ilm...|  male|          19|  3rd|       S|      Finland| 3101287| 7.1806|    0|    0|      no|
|      Ali, Mr. Ahmed|  male|          24|  3rd|       S|    Argentina| 3101311|   7.01|    0|    0|      no|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
only showing top 20 rows

In [7]:
df = spark.read.option('header', 'true').csv('titanic.csv')
df.show()

+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
|                name|gender|         age|class|embarked|      country|ticketno|   fare|sibsp|parch|survived|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
| Abbing, Mr. Anthony|  male|          42|  3rd|       S|United States|    5547|   7.11|    0|    0|      no|
|Abbott, Mr. Eugen...|  male|          13|  3rd|       S|United States|    2673|  20.05|    0|    2|      no|
|Abbott, Mr. Rossm...|  male|          16|  3rd|       S|United States|    2673|  20.05|    1|    1|      no|
|Abbott, Mrs. Rhod...|female|          39|  3rd|       S|      England|    2673|  20.05|    1|    1|     yes|
|Abelseth, Miss. K...|female|          16|  3rd|       S|       Norway|  348125|   7.13|    0|    0|     yes|
|Abelseth, Mr. Ola...|  male|          25|  3rd|       S|United States|  348122|   7.13|    0|    0|     yes|
| Abelson, Mr. Samuel|  male|          30|  2nd|       C|       France|    3381|     24|    1|    0|      no|
|Abelson, Mrs. Hannah|female|          28|  2nd|       C|       France|    3381|     24|    1|    0|     yes|
|Abī-Al-Munà, Mr. ...|  male|          27|  3rd|       C|      Lebanon|    2699|18.1509|    0|    0|     yes|
|Abrahamsson, Mr. ...|  male|          20|  3rd|       S|      Finland| 3101284| 7.1806|    0|    0|     yes|
|  Ådahl, Mr. Mauritz|  male|          30|  3rd|       S|       Sweden|    7076|   7.05|    0|    0|      no|
|     Adams, Mr. John|  male|          27|  3rd|       S|      England|  341826|   8.01|    0|    0|      no|
|Ahlin, Mrs. Johan...|female|          40|  3rd|       S|       Sweden|    7546| 9.0906|    1|    0|      no|
|Aks, Master. Fran...|  male|0.8333333333|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|      Aks, Mrs. Leah|female|          18|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|Aldworth, Mr. Aug...|  male|          35|  2nd|       S|      England|  248744|     13|    0|    0|      no|
|Alexander, Mr. Wi...|  male|          25|  3rd|       S|      England|    3474| 7.1709|    0|    0|      no|
|Alhomäki, Mr. Ilm...|  male|          19|  3rd|       S|      Finland| 3101287| 7.1806|    0|    0|      no|
|      Ali, Mr. Ahmed|  male|          24|  3rd|       S|    Argentina| 3101311|   7.01|    0|    0|      no|
|    Ali, Mr. William|  male|          25|  3rd|       S|    Argentina| 3101312|   7.01|    0|    0|      no|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
only showing top 20 rows

In [8]:
type(df)

pyspark.sql.dataframe.DataFrame

In [9]:
df.head()

Row(name='Abbing, Mr. Anthony', gender='male', age='42', class='3rd', embarked='S', country='United States', ticketno='5547', fare='7.11', sibsp='0', parch='0', survived='no')

In [10]:
df.printSchema()

root
 |-- name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- age: string (nullable = true)
 |-- class: string (nullable = true)
 |-- embarked: string (nullable = true)
 |-- country: string (nullable = true)
 |-- ticketno: string (nullable = true)
 |-- fare: string (nullable = true)
 |-- sibsp: string (nullable = true)
 |-- parch: string (nullable = true)
 |-- survived: string (nullable = true)

In [16]:
df1 = spark.read.csv("titanic.csv", header=True, inferSchema=True)
df1.printSchema()

root
 |-- name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- age: string (nullable = true)
 |-- class: string (nullable = true)
 |-- embarked: string (nullable = true)
 |-- country: string (nullable = true)
 |-- ticketno: string (nullable = true)
 |-- fare: string (nullable = true)
 |-- sibsp: string (nullable = true)
 |-- parch: string (nullable = true)
 |-- survived: string (nullable = true)

In [14]:
import pandas as pd

In [15]:
pandas_df = pd.read_csv("titanic.csv")
pandas_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2207 entries, 0 to 2206
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      2207 non-null   object
 1   gender    2207 non-null   object
 2   age       2205 non-null   float64
 3   class     2207 non-null   object
 4   embarked  2207 non-null   object
 5   country   2126 non-null   object
 6   ticketno  1316 non-null   float64
 7   fare      1291 non-null   float64
 8   sibsp     1307 non-null   float64
 9   parch     1307 non-null   float64
 10  survived  2207 non-null   object
dtypes: float64(5), object(6)
memory usage: 189.8+ KB

Even though you're using inferSchema=True in your Spark read.csv() call, all columns are still being read as string. This happens because Spark’s schema inference is limited when reading CSV files, especially if:

The data has missing or inconsistent values.

The header row is misleading or malformed.

Spark reads only a small sample of data and can't confidently infer types.

In [17]:
df.select("name").show()

+--------------------+
|                name|
+--------------------+
| Abbing, Mr. Anthony|
|Abbott, Mr. Eugen...|
|Abbott, Mr. Rossm...|
|Abbott, Mrs. Rhod...|
|Abelseth, Miss. K...|
|Abelseth, Mr. Ola...|
| Abelson, Mr. Samuel|
|Abelson, Mrs. Hannah|
|Abī-Al-Munà, Mr. ...|
|Abrahamsson, Mr. ...|
|  Ådahl, Mr. Mauritz|
|     Adams, Mr. John|
|Ahlin, Mrs. Johan...|
|Aks, Master. Fran...|
|      Aks, Mrs. Leah|
|Aldworth, Mr. Aug...|
|Alexander, Mr. Wi...|
|Alhomäki, Mr. Ilm...|
|      Ali, Mr. Ahmed|
|    Ali, Mr. William|
+--------------------+
only showing top 20 rows

In [19]:
df.dtypes

[('name', 'string'),
 ('gender', 'string'),
 ('age', 'string'),
 ('class', 'string'),
 ('embarked', 'string'),
 ('country', 'string'),
 ('ticketno', 'string'),
 ('fare', 'string'),
 ('sibsp', 'string'),
 ('parch', 'string'),
 ('survived', 'string')]

In [25]:
## add columns in the data frame
df.withColumn("name + age", df['name']+df['age']).show()

+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+----------+
|                name|gender|         age|class|embarked|      country|ticketno|   fare|sibsp|parch|survived|name + age|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+----------+
| Abbing, Mr. Anthony|  male|          42|  3rd|       S|United States|    5547|   7.11|    0|    0|      no|      null|
|Abbott, Mr. Eugen...|  male|          13|  3rd|       S|United States|    2673|  20.05|    0|    2|      no|      null|
|Abbott, Mr. Rossm...|  male|          16|  3rd|       S|United States|    2673|  20.05|    1|    1|      no|      null|
|Abbott, Mrs. Rhod...|female|          39|  3rd|       S|      England|    2673|  20.05|    1|    1|     yes|      null|
|Abelseth, Miss. K...|female|          16|  3rd|       S|       Norway|  348125|   7.13|    0|    0|     yes|      null|
|Abelseth, Mr. Ola...|  male|          25|  3rd|       S|United States|  348122|   7.13|    0|    0|     yes|      null|
| Abelson, Mr. Samuel|  male|          30|  2nd|       C|       France|    3381|     24|    1|    0|      no|      null|
|Abelson, Mrs. Hannah|female|          28|  2nd|       C|       France|    3381|     24|    1|    0|     yes|      null|
|Abī-Al-Munà, Mr. ...|  male|          27|  3rd|       C|      Lebanon|    2699|18.1509|    0|    0|     yes|      null|
|Abrahamsson, Mr. ...|  male|          20|  3rd|       S|      Finland| 3101284| 7.1806|    0|    0|     yes|      null|
|  Ådahl, Mr. Mauritz|  male|          30|  3rd|       S|       Sweden|    7076|   7.05|    0|    0|      no|      null|
|     Adams, Mr. John|  male|          27|  3rd|       S|      England|  341826|   8.01|    0|    0|      no|      null|
|Ahlin, Mrs. Johan...|female|          40|  3rd|       S|       Sweden|    7546| 9.0906|    1|    0|      no|      null|
|Aks, Master. Fran...|  male|0.8333333333|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|      null|
|      Aks, Mrs. Leah|female|          18|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|      null|
|Aldworth, Mr. Aug...|  male|          35|  2nd|       S|      England|  248744|     13|    0|    0|      no|      null|
|Alexander, Mr. Wi...|  male|          25|  3rd|       S|      England|    3474| 7.1709|    0|    0|      no|      null|
|Alhomäki, Mr. Ilm...|  male|          19|  3rd|       S|      Finland| 3101287| 7.1806|    0|    0|      no|      null|
|      Ali, Mr. Ahmed|  male|          24|  3rd|       S|    Argentina| 3101311|   7.01|    0|    0|      no|      null|
|    Ali, Mr. William|  male|          25|  3rd|       S|    Argentina| 3101312|   7.01|    0|    0|      no|      null|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+----------+
only showing top 20 rows

In [26]:
df.show()

+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
|                name|gender|         age|class|embarked|      country|ticketno|   fare|sibsp|parch|survived|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
| Abbing, Mr. Anthony|  male|          42|  3rd|       S|United States|    5547|   7.11|    0|    0|      no|
|Abbott, Mr. Eugen...|  male|          13|  3rd|       S|United States|    2673|  20.05|    0|    2|      no|
|Abbott, Mr. Rossm...|  male|          16|  3rd|       S|United States|    2673|  20.05|    1|    1|      no|
|Abbott, Mrs. Rhod...|female|          39|  3rd|       S|      England|    2673|  20.05|    1|    1|     yes|
|Abelseth, Miss. K...|female|          16|  3rd|       S|       Norway|  348125|   7.13|    0|    0|     yes|
|Abelseth, Mr. Ola...|  male|          25|  3rd|       S|United States|  348122|   7.13|    0|    0|     yes|
| Abelson, Mr. Samuel|  male|          30|  2nd|       C|       France|    3381|     24|    1|    0|      no|
|Abelson, Mrs. Hannah|female|          28|  2nd|       C|       France|    3381|     24|    1|    0|     yes|
|Abī-Al-Munà, Mr. ...|  male|          27|  3rd|       C|      Lebanon|    2699|18.1509|    0|    0|     yes|
|Abrahamsson, Mr. ...|  male|          20|  3rd|       S|      Finland| 3101284| 7.1806|    0|    0|     yes|
|  Ådahl, Mr. Mauritz|  male|          30|  3rd|       S|       Sweden|    7076|   7.05|    0|    0|      no|
|     Adams, Mr. John|  male|          27|  3rd|       S|      England|  341826|   8.01|    0|    0|      no|
|Ahlin, Mrs. Johan...|female|          40|  3rd|       S|       Sweden|    7546| 9.0906|    1|    0|      no|
|Aks, Master. Fran...|  male|0.8333333333|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|      Aks, Mrs. Leah|female|          18|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|Aldworth, Mr. Aug...|  male|          35|  2nd|       S|      England|  248744|     13|    0|    0|      no|
|Alexander, Mr. Wi...|  male|          25|  3rd|       S|      England|    3474| 7.1709|    0|    0|      no|
|Alhomäki, Mr. Ilm...|  male|          19|  3rd|       S|      Finland| 3101287| 7.1806|    0|    0|      no|
|      Ali, Mr. Ahmed|  male|          24|  3rd|       S|    Argentina| 3101311|   7.01|    0|    0|      no|
|    Ali, Mr. William|  male|          25|  3rd|       S|    Argentina| 3101312|   7.01|    0|    0|      no|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
only showing top 20 rows

In [28]:
df.withColumnRenamed("name", "Name").show()

+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
|                Name|gender|         age|class|embarked|      country|ticketno|   fare|sibsp|parch|survived|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
| Abbing, Mr. Anthony|  male|          42|  3rd|       S|United States|    5547|   7.11|    0|    0|      no|
|Abbott, Mr. Eugen...|  male|          13|  3rd|       S|United States|    2673|  20.05|    0|    2|      no|
|Abbott, Mr. Rossm...|  male|          16|  3rd|       S|United States|    2673|  20.05|    1|    1|      no|
|Abbott, Mrs. Rhod...|female|          39|  3rd|       S|      England|    2673|  20.05|    1|    1|     yes|
|Abelseth, Miss. K...|female|          16|  3rd|       S|       Norway|  348125|   7.13|    0|    0|     yes|
|Abelseth, Mr. Ola...|  male|          25|  3rd|       S|United States|  348122|   7.13|    0|    0|     yes|
| Abelson, Mr. Samuel|  male|          30|  2nd|       C|       France|    3381|     24|    1|    0|      no|
|Abelson, Mrs. Hannah|female|          28|  2nd|       C|       France|    3381|     24|    1|    0|     yes|
|Abī-Al-Munà, Mr. ...|  male|          27|  3rd|       C|      Lebanon|    2699|18.1509|    0|    0|     yes|
|Abrahamsson, Mr. ...|  male|          20|  3rd|       S|      Finland| 3101284| 7.1806|    0|    0|     yes|
|  Ådahl, Mr. Mauritz|  male|          30|  3rd|       S|       Sweden|    7076|   7.05|    0|    0|      no|
|     Adams, Mr. John|  male|          27|  3rd|       S|      England|  341826|   8.01|    0|    0|      no|
|Ahlin, Mrs. Johan...|female|          40|  3rd|       S|       Sweden|    7546| 9.0906|    1|    0|      no|
|Aks, Master. Fran...|  male|0.8333333333|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|      Aks, Mrs. Leah|female|          18|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|Aldworth, Mr. Aug...|  male|          35|  2nd|       S|      England|  248744|     13|    0|    0|      no|
|Alexander, Mr. Wi...|  male|          25|  3rd|       S|      England|    3474| 7.1709|    0|    0|      no|
|Alhomäki, Mr. Ilm...|  male|          19|  3rd|       S|      Finland| 3101287| 7.1806|    0|    0|      no|
|      Ali, Mr. Ahmed|  male|          24|  3rd|       S|    Argentina| 3101311|   7.01|    0|    0|      no|
|    Ali, Mr. William|  male|          25|  3rd|       S|    Argentina| 3101312|   7.01|    0|    0|      no|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
only showing top 20 rows

In [30]:
from pyspark.sql.types import StructType, StructField, StringType, IntegerType, DoubleType

schema = StructType([
    StructField("name", StringType(), True),
    StructField("gender", StringType(), True),
    StructField("age", DoubleType(), True),
    StructField("class", StringType(), True),
    StructField("embarked", StringType(), True),
    StructField("country", StringType(), True),
    StructField("ticketno", StringType(), True),
    StructField("fare", DoubleType(), True),
    StructField("sibsp", IntegerType(), True),
    StructField("parch", IntegerType(), True),
    StructField("survived", IntegerType(), True)
])
df = spark.read.csv("titanic.csv", header=True, schema=schema)
df.printSchema()

root
 |-- name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- age: double (nullable = true)
 |-- class: string (nullable = true)
 |-- embarked: string (nullable = true)
 |-- country: string (nullable = true)
 |-- ticketno: string (nullable = true)
 |-- fare: double (nullable = true)
 |-- sibsp: integer (nullable = true)
 |-- parch: integer (nullable = true)
 |-- survived: integer (nullable = true)

In [33]:
df = df.withColumn("test", df['age'])

In [34]:
df.head()

Row(name='Abbing, Mr. Anthony', gender='male', age=42.0, class='3rd', embarked='S', country='United States', ticketno='5547', fare=7.11, sibsp=0, parch=0, survived=None, test=42.0)

In [35]:
df.drop("test")

DataFrame[name: string, gender: string, age: double, class: string, embarked: string, country: string, ticketno: string, fare: double, sibsp: int, parch: int, survived: int]

In [38]:
df.na.drop().show()

+----+------+---+-----+--------+-------+--------+----+-----+-----+--------+----+
|name|gender|age|class|embarked|country|ticketno|fare|sibsp|parch|survived|test|
+----+------+---+-----+--------+-------+--------+----+-----+-----+--------+----+
+----+------+---+-----+--------+-------+--------+----+-----+-----+--------+----+

In [40]:
df.na.drop(how="any", thresh=3).show()

+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+------------+
|                name|gender|         age|class|embarked|      country|ticketno|   fare|sibsp|parch|survived|        test|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+------------+
| Abbing, Mr. Anthony|  male|        42.0|  3rd|       S|United States|    5547|   7.11|    0|    0|    null|        42.0|
|Abbott, Mr. Eugen...|  male|        13.0|  3rd|       S|United States|    2673|  20.05|    0|    2|    null|        13.0|
|Abbott, Mr. Rossm...|  male|        16.0|  3rd|       S|United States|    2673|  20.05|    1|    1|    null|        16.0|
|Abbott, Mrs. Rhod...|female|        39.0|  3rd|       S|      England|    2673|  20.05|    1|    1|    null|        39.0|
|Abelseth, Miss. K...|female|        16.0|  3rd|       S|       Norway|  348125|   7.13|    0|    0|    null|        16.0|
|Abelseth, Mr. Ola...|  male|        25.0|  3rd|       S|United States|  348122|   7.13|    0|    0|    null|        25.0|
| Abelson, Mr. Samuel|  male|        30.0|  2nd|       C|       France|    3381|   24.0|    1|    0|    null|        30.0|
|Abelson, Mrs. Hannah|female|        28.0|  2nd|       C|       France|    3381|   24.0|    1|    0|    null|        28.0|
|Abī-Al-Munà, Mr. ...|  male|        27.0|  3rd|       C|      Lebanon|    2699|18.1509|    0|    0|    null|        27.0|
|Abrahamsson, Mr. ...|  male|        20.0|  3rd|       S|      Finland| 3101284| 7.1806|    0|    0|    null|        20.0|
|  Ådahl, Mr. Mauritz|  male|        30.0|  3rd|       S|       Sweden|    7076|   7.05|    0|    0|    null|        30.0|
|     Adams, Mr. John|  male|        27.0|  3rd|       S|      England|  341826|   8.01|    0|    0|    null|        27.0|
|Ahlin, Mrs. Johan...|female|        40.0|  3rd|       S|       Sweden|    7546| 9.0906|    1|    0|    null|        40.0|
|Aks, Master. Fran...|  male|0.8333333333|  3rd|       S|      England|  392091|   9.07|    0|    1|    null|0.8333333333|
|      Aks, Mrs. Leah|female|        18.0|  3rd|       S|      England|  392091|   9.07|    0|    1|    null|        18.0|
|Aldworth, Mr. Aug...|  male|        35.0|  2nd|       S|      England|  248744|   13.0|    0|    0|    null|        35.0|
|Alexander, Mr. Wi...|  male|        25.0|  3rd|       S|      England|    3474| 7.1709|    0|    0|    null|        25.0|
|Alhomäki, Mr. Ilm...|  male|        19.0|  3rd|       S|      Finland| 3101287| 7.1806|    0|    0|    null|        19.0|
|      Ali, Mr. Ahmed|  male|        24.0|  3rd|       S|    Argentina| 3101311|   7.01|    0|    0|    null|        24.0|
|    Ali, Mr. William|  male|        25.0|  3rd|       S|    Argentina| 3101312|   7.01|    0|    0|    null|        25.0|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+------------+
only showing top 20 rows

In [ ]:
df.na.drop(how="any", thresh=3).show()